In [87]:
import numpy as np
import pandas as pd

# Pandas Series and Dataframes

## Series: Labelled Indexes

In [88]:
labels = ['a','b','c']
myList = [10,20,30]
arr = np.array([10,20,30])
d = {'a': 10, 'b': 20, 'c': 30}

In [89]:
ser = pd.Series(data=myList,index=labels)

Now you can grab data from the panda series using either the index or the label

In [90]:
ser['a']

10

Series can be created directly from dictionaries

In [91]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### More complicated series...

In [92]:
salesQ1 = pd.Series(data=[250,450,200,150],index=['USA','China','India','Brazil'])

In [93]:
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [94]:
salesQ2 = pd.Series(data=[260,500,210,100],index=['USA','China','India','Japan'])

In [95]:
salesQ2

USA      260
China    500
India    210
Japan    100
dtype: int64

In [96]:
salesQ2['China']

500

### Operations between Series

In [97]:
salesQ1 + salesQ2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

Notice that for labels that do not appear in both series, a value of $$NaN$$ is returned.

## Dataframes
- Multiple pandas series that share the same index
- Analogous to an excel spreadsheet

In [98]:
columns = ['W','X','Y','Z']
index = ['A','B','C','D','E']

In [99]:
from numpy.random import randint

In [100]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [101]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

Lets create the dataframe

In [102]:
df = pd.DataFrame(data,index,columns)

In [103]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

Recall that a dataframe consists of multiple series...

Lets select a single column now:

In [104]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

Lets get a bunch of columns:

Note that this will return a dataframe since it consists of multiple columns (series)

In [105]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

### Feature Engineering

Creating/Deleting columns using existing data

In [106]:
df['new'] = df['W'] + df['Y']

In [107]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

Removing data if data is too noisy etc...

In [108]:
df.drop('new',axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

Note that the above is not done in place

In [109]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [110]:
df = df.drop('new',axis=1)

Lets do the same stuff now for rows! Since row and column names could overlap,
when manipulating rows use $$\textbf{df.loc[ ]}$$

In [111]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [112]:
df.loc[['A', 'E']]

    W   X   Y   Z
A   2  79  -8 -86
E  30  49 -48 -99

Note that you can also do pythonic list indexing

In [113]:
df.iloc[:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [114]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [115]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

Fetch data using this method:

In [116]:
df.loc['A','W']

2

In [117]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

### Filtering dataframes

In [118]:
df[df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

A use case is filtering based on features. This will return rows that meet the condition
specified.

In [119]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [120]:
df[df['X']>0]['W']

A     2
C     2
E    30
Name: W, dtype: int64

One can filter based on multiple conditions as well:

In [121]:
df[(df['W']>0) & (df['Y']>1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

Resetting index is possible

In [122]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

Use a column as index

In [123]:
new_ind = ['CA','NY','WY','OR','CO']

In [124]:
df['States'] = new_ind

In [125]:
df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [126]:
df.set_index('States')

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

### Summary stats

In [127]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

# Dealing with missing data
How to deal with it?
- Do nothing
- Remove it
    - Large percentage missing?
        - If the missing data is from the feature column, just remove that column
    - Small percentage missing?
        - Drop the corresponding rows
- Fill it in (Hardest)
    - A non-trivial percentage is missing & the data point rows are important
    - Strategies:
        - Fill in with one of Mode, median, mean
        - Base the new value off another feature column, conceive of a reasonable value

In [128]:
df_missing = pd.DataFrame({
    'A': [1,2,np.nan,4],
    'B': [5,np.nan,np.nan,8],
    'C': [10,20,30,40]
})

In [129]:
df_missing

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

Strategy 2: Remove missing data

In [130]:
# calculate threshold if needed
# thresh = 0.5 * len(df_missing)
df_missing.dropna(axis=1,thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

Strategy 3: Fill in data

In [131]:
df_missing.fillna(value='ANYTHING')

          A         B   C
0         1         5  10
1         2  ANYTHING  20
2  ANYTHING  ANYTHING  30
3         4         8  40

In [132]:
df_missing['A'] = df_missing['A'].fillna(value=0)

In [133]:
df_missing

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

Lets fill up the missing values in feature B with the mean of the filled cells.

This is a common strategy.

In [134]:
df_missing['B'].fillna(value=df_missing['B'].mean())

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

In [135]:
df_missing.fillna(df_missing.mean())

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

# Group By operations
AKA Split - Apply - Combine

In [139]:
univ_df = pd.read_csv('/home/abhinav/Desktop/Python/tensorflow2-keras-deep-learning-course/pandas-overview/Universities.csv')

In [140]:
univ_df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [142]:
univ_df.groupby('Year').sum().sort_index(ascending=False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [143]:
univ_df.groupby(['Year', 'Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

Use `describe` after `groupby` to get useful summary statistics across categories from the data set

In [145]:
univ_df.groupby('Year').describe().transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

# Pandas ops

In [146]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                   'col1':[100,200,300,300,400,500],
                   'col2':['NY','CA','WA','WA','AK','NV']})

In [147]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

Get unique values

In [150]:
df_one['col2'].value_counts()

WA    2
CA    1
AK    1
NY    1
NV    1
Name: col2, dtype: int64

In [151]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [152]:
df_one['NEW'] = df_one['col1'] * 10

In [153]:
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

## Applying functions to a dataframe to transform data
- Watch out for datatype errors!
- Includes `map`, `max` etc...

In [154]:
def grab_first_letter(state):
    """
    Requires state to be a string!
    :param state:
    :return:
    """
    return state[0]

In [155]:
grab_first_letter('NY')

'N'

In [156]:
df_one['first letter'] = df_one['col2'].apply(grab_first_letter)

In [157]:
df_one

  k1  col1 col2   NEW first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [158]:
def complex_letter(state):
    """
    :param state:  STRING type
    :return:
    """
    if state[0] == "W":
        return "Washington"
    else:
        return "Error"

In [159]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [161]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [162]:
my_map = {'A':1,'B':2,'C':3}

In [163]:
df_one['num'] = df_one['k1'].map(my_map)

In [164]:
df_one

  k1  col1 col2   NEW first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

In [165]:
df_one['col1'].idxmax()

5

In [166]:
df_one.columns

Index(['k1', 'col1', 'col2', 'NEW', 'first letter', 'num'], dtype='object')

In [167]:
df_one.columns = ['c1','c2','c3','c4','c5','c6']

In [170]:
df_one.sort_values('c3')

  c1   c2  c3    c4 c5  c6
4  C  400  AK  4000  A   3
1  A  200  CA  2000  C   1
5  C  500  NV  5000  N   3
0  A  100  NY  1000  N   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2

## Concatenating dataframes

In [171]:
features = pd.DataFrame({'A':[100,200,300,400,500], 'B':[12,13,14,15,16]})
predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [172]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [173]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [176]:
pd.concat([features,predictions],axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

One-Hot encoding steps

In [177]:
df_one['c1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: c1, dtype: object

In [178]:
pd.get_dummies(df_one['c1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1